###########################################################################
#
# Generated by : Version 10.0 Build 218 06/27/2010 SJ Full Version
#
# Project      : RevCFPGA
# Revision     : RevCFPGA
#
# Date         : Fri Dec 28 09:14:04 CST 2012
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------

# Original Clock Setting Name: VXOClk
create_clock -period "25.000 ns" -name {VXOClk} {VXOClk}
create_clock -period "6.25 ns"   -name {QDCO} -waveform { 0.000 3.125 } [get_ports {QDCO}]

# ---------------------------------------------


# Original Clock Setting Name: EncClk
create_clock -period "25.000 ns" \
             -name {EncClk} {EncClk}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------
# Align ADCFrame signals with ADC DCO
set_input_delay -clock [get_clocks {QDCO}] 0 [get_ports {QFR}]

# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------


# ** Tco/MinTco requirements
#    -----------------------

#
# Entity Specific Timing Assignments found in
# the Timing Analyzer Settings report panel
#
set_false_path -from [get_keepers {*dcfifo_hjk1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_hjk1*|*rs_dgwp|*dffpipe12|dffe13a[*]}]
set_false_path -from [get_keepers {*dcfifo_hjk1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_hjk1*|*ws_dgrp|*dffpipe16|dffe17a[*]}]
set_false_path -from [get_keepers {*dcfifo_jkk1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_jkk1*|*rs_dgwp|*dffpipe23|dffe24a[*]}]
set_false_path -from [get_keepers {*dcfifo_jkk1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_jkk1*|*ws_dgrp|*dffpipe27|dffe28a[*]}]
set_false_path -from [get_keepers {*dcfifo_ljk1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_ljk1*|*rs_dgwp|*dffpipe23|dffe24a[*]}]
set_false_path -from [get_keepers {*dcfifo_ljk1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_ljk1*|*ws_dgrp|*dffpipe27|dffe28a[*]}]
set_false_path -from [get_keepers {*dcfifo_njk1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_njk1*|*rs_dgwp|*dffpipe22|dffe23a[*]}]
set_false_path -from [get_keepers {*dcfifo_njk1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_njk1*|*ws_dgrp|*dffpipe26|dffe27a[*]}]
set_false_path -from [get_keepers {*dcfifo_qhk1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_qhk1*|*rs_dgwp|*dffpipe23|dffe24a[*]}]
set_false_path -from [get_keepers {*dcfifo_qhk1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_qhk1*|*ws_dgrp|*dffpipe27|dffe28a[*]}]


# ---------------------------------------------
# The following clock group is added to try to 
# match the behavior of:
#   CUT_OFF_PATHS_BETWEEN_CLOCK_DOMAINS = ON
# ---------------------------------------------

set_clock_groups -asynchronous \
                 -group { \
                       PhADCPll:PhPll|altpll:altpll_component|_clk0 \
                       EncClk \
                        } \
                 -group { \
                       vxopll:SysPll|altpll:altpll_component|_clk0 \
                       vxopll:SysPll|altpll:altpll_component|_clk1 \
                       vxopll:SysPll|altpll:altpll_component|_clk2 \
                       VXOClk \
                        } \

# ---------------------------------------------

